In [1]:
import pandas as pd

In [2]:
data = [['Akshit', 34] , ['Mohit', 25], ['Neha', 55], ['Manan', 23]]

In [3]:
data

[['Akshit', 34], ['Mohit', 25], ['Neha', 55], ['Manan', 23]]

In [5]:
pd.DataFrame(data, columns=["Name", "Marks"])

     Name  Marks
0  Akshit     34
1   Mohit     25
2    Neha     55
3   Manan     23